blog.org
#+hugo_base_dir: .
#+options: author:nil

** Changes Coming to 16chan :16chan:
:PROPERTIES:
:EXPORT_FILE_NAME: 16chan-updates
:EXPORT_DATE: <2019-11-10 Sun>
:END:
Greetings Anons, this is the first update regarding 16chan's
development path. As some of you may or may not know, LynxChan is
getting an update to version 2.3.0 (we are currently on 2.2.X) and
with it will come several changes, most of which are targeted at
updated administrative tools, and ease of use for administrators. That
being said, I am using this as an opportunity to finally hammer out
many of the bugs, and changes users have requested. In no particular
order, these are the changes coming to 16chan:

*** Boards being removed
Due to the traffic of 16chan, and the userbase primarily coming to
=/pol/=, and and many of the administrators have decided to remove
several inactive boards, and mesh them into a new =/culture/=
board. Think of =/culture/= as a general hobbyist board, where topics
like =/a/=, =/tv/=, =/mu/=, etc can be discussed. The boards that are being
removed may be added back later if traffic increases, and the demand
is there. These are the boards that are getting removed:

- =/a/=, Anime & Manga
- =/biz/=, Business & Finance
- =/fit/=, Fitness
- =/hypno/=, Hypnotism
- =/int/=, International
- =/tv/=, Television & Film
- =/redpill/= and =/library/= will be merged into one board since they
  are so vastly similar and fragment traffic from one another.

*Note:* I plan on launching another niche imageboard centered around
=/tv/= (and maybe would also have a =/v/= board). I plan on starting
work on this project after we have fully transitioned to LynxChan
2.3.0.

*** Migrating Hosts
Currently we are hosting 16chan on DigitalOcean but we are migrating to [[https://cockbox.org/][Cockbox]], a more
secure and privacy respecting VPS. There will be an announcement made
for when the migration will be held, we expect it to take less than 24
hours, the transition is projected to be smooth.

*** Updating front-end
The front-end is getting an overhaul, and many of the broken features
are getting fixed, overall the site will look better, and be a bit
more functional.

All of these changes I expect to have rolled out by the end of
November/Early December, and I will continue to periodically post
updates on 16chan's =/meta/= board, and through global announcements
on 16chan.

